Revit 2024 API
SunAndShadowSettings.ProjectLocationId Property
 Identifies the ProjectLocation element used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId ProjectLocationId { get; }
Visual Basic
Public ReadOnly Property ProjectLocationId As ElementId
	Get
Visual C++
public:
property ElementId^ ProjectLocationId {
	ElementId^ get ();
}
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace